app/Controllers/AdminController.php

    public function residentes()
    {
        $residenteModel = new ResidenteModel();

        $residentes = $residenteModel
            ->select('residentes.*, usuarios.correo, usuarios.estado')
            ->join('usuarios', 'usuarios.id = residentes.usuario_id', 'left')
            ->findAll();

        $apartamentoModel = new ApartamentoModel();
        $apartamentos = $apartamentoModel->findAll();
---
SELECT `residentes`.*, `usuarios`.`correo`, `usuarios`.`estado`
FROM `residentes`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `residentes`.`usuario_id`
SELECT *
FROM `apartamentos`

    public function finanzasCobro()
    {
        $condominioModel = new CondominioModel();

        $datos = [
            'condominios'  => $condominioModel->findAll(),
            'anio_actual'  => (int) date('Y'),
            'mes_actual'   => (int) date('n'),
        ];
---
SELECT *
FROM `condominios`

    public function soporte()
    {
        $ticketModel = new \App\Models\TicketModel();

        $tickets = $ticketModel
            ->select('tickets_soporte.*, residentes.nombre_completo, residentes.telefono, usuarios.correo')
            ->join('usuarios', 'usuarios.id = tickets_soporte.usuario_id')
            ->join('residentes', 'residentes.usuario_id = usuarios.id', 'left')
            ->orderBy('tickets_soporte.fecha_creacion', 'DESC')
            ->findAll();
---
SELECT `tickets_soporte`.*, `residentes`.`nombre_completo`, `residentes`.`telefono`, `usuarios`.`correo`
FROM `tickets_soporte`
JOIN `usuarios` ON `usuarios`.`id` = `tickets_soporte`.`usuario_id`
LEFT JOIN `residentes` ON `residentes`.`usuario_id` = `usuarios`.`id`
ORDER BY `tickets_soporte`.`fecha_creacion` DESC