app/Controllers/AdminController.php

    public function finanzasPagos()
    {
        $pagoModel = new PagoModel();

        // Pagos pendientes de validación con datos del recibo, apartamento y residente
        $pagos = $pagoModel
            ->select('pagos_recibidos.*, recibos_mensuales.mes, recibos_mensuales.anio, recibos_mensuales.monto_total, apartamentos.nro_apartamento, residentes.nombre_completo')
            ->join('recibos_mensuales', 'recibos_mensuales.id = pagos_recibidos.recibo_mensual_id')
            ->join('apartamentos', 'apartamentos.id = recibos_mensuales.apartamento_id')
            ->join('residentes', 'residentes.id = apartamentos.residente_id', 'left')
            ->where('pagos_recibidos.estado_validacion', 'Por Validar')
            ->orderBy('pagos_recibidos.fecha_registro', 'DESC')
            ->findAll();
---
SELECT `pagos_recibidos`.*, `recibos_mensuales`.`mes`, `recibos_mensuales`.`anio`, `recibos_mensuales`.`monto_total`, `apartamentos`.`nro_apartamento`, `residentes`.`nombre_completo`
FROM `pagos_recibidos`
JOIN `recibos_mensuales` ON `recibos_mensuales`.`id` = `pagos_recibidos`.`recibo_mensual_id`
JOIN `apartamentos` ON `apartamentos`.`id` = `recibos_mensuales`.`apartamento_id`
LEFT JOIN `residentes` ON `residentes`.`id` = `apartamentos`.`residente_id`
WHERE `pagos_recibidos`.`estado_validacion` = 'Por Validar'
ORDER BY `pagos_recibidos`.`fecha_registro` DESC