app/Controllers/GestionUsuariosRootController.php

SELECT *
FROM `usuarios`
WHERE `estado` != 'eliminado'
---
    public function index()
    {
        $usuarioModel = new UsuarioModel();

        // Listar usuarios excluyendo los que tienen eliminación lógica
        $usuarios = $usuarioModel->where('estado !=', 'eliminado')->findAll();