app/Controllers/SuperController.php

    public function apartamentos()
    {
        $condominioModel = new \App\Models\CondominioModel();
        $apartamentoModel = new \App\Models\ApartamentoModel();

        $apartamentos = $apartamentoModel->select('apartamentos.*, condominios.nombre_condominio, residentes.nombre_completo AS nombre_residente')
                                         ->join('condominios', 'condominios.id = apartamentos.condominio_id')
                                         ->join('residentes', 'residentes.id = apartamentos.residente_id', 'left')
                                         ->findAll();

        $datos = [
            'condominios' => $condominioModel->findAll(),
            'apartamentos' => $apartamentos,
        ];
---
SELECT `apartamentos`.*, `condominios`.`nombre_condominio`, `residentes`.`nombre_completo` AS `nombre_residente`
FROM `apartamentos`
JOIN `condominios` ON `condominios`.`id` = `apartamentos`.`condominio_id`
LEFT JOIN `residentes` ON `residentes`.`id` = `apartamentos`.`residente_id`
SELECT *
FROM `condominios`

    public function registrarApartamento()
    {
        $apartamentoModel = new \App\Models\ApartamentoModel();
        $condominioModel  = new \App\Models\CondominioModel();

        $condominioId  = (int) $this->request->getPost('condominio_id');
        $nroApartamento = trim($this->request->getPost('numero_apto') ?? '');
        $metrosApto    = (float) $this->request->getPost('metros_cuadrados_apto');

        // Validaciones básicas
        if ($condominioId <= 0) {
            return redirect()->back()->with('error', 'Debe seleccionar un condominio válido.');
        }
        if (empty($nroApartamento)) {
            return redirect()->back()->with('error', 'El número de apartamento es obligatorio.');
        }
        if ($metrosApto <= 0) {
            return redirect()->back()->with('error', 'Los metros cuadrados del apartamento deben ser mayor a 0.');
        }

        // Obtener el condominio para calcular la alícuota proporcional
        $condominio = $condominioModel->find($condominioId);
---
SELECT *
FROM `condominios`
WHERE `condominios`.`id` = 1

            'alicuota'              => $alicuota,
        ];

        if (! $apartamentoModel->insert($datos)) {
---
INSERT INTO `apartamentos` (`condominio_id`, `residente_id`, `nombre_edificio_torre`, `nro_apartamento`, `metros_cuadrados`, `alicuota`) VALUES (1, NULL, 'albirecoque A', '001', 10000, 8.122)