app/Models/ApartamentoModel.php

    public function obtenerPorUsuario(int $usuarioId): array
    {
        return $this->select('apartamentos.*, condominios.nombre_condominio')
                    ->join('residentes', 'residentes.id = apartamentos.residente_id')
                    ->join('condominios', 'condominios.id = apartamentos.condominio_id')
                    ->where('residentes.usuario_id', $usuarioId)
                    ->findAll();
---
SELECT `apartamentos`.*, `condominios`.`nombre_condominio`
FROM `apartamentos`
JOIN `residentes` ON `residentes`.`id` = `apartamentos`.`residente_id`
JOIN `condominios` ON `condominios`.`id` = `apartamentos`.`condominio_id`
WHERE `residentes`.`usuario_id` = 1