app/Models/ComunicadoModel.php

SELECT `noticias_comunicados`.*, `usuarios`.`correo` AS `correo_autor`
FROM `noticias_comunicados`
JOIN `usuarios` ON `usuarios`.`id` = `noticias_comunicados`.`autor_id`
WHERE `noticias_comunicados`.`estado` = 'publicado'
ORDER BY `noticias_comunicados`.`fecha_publicacion` DESC
---
    public function listarActivosConAutor(): array
    {
        return $this->select('noticias_comunicados.*, usuarios.correo AS correo_autor')
                    ->join('usuarios', 'usuarios.id = noticias_comunicados.autor_id')
                    ->where('noticias_comunicados.estado', 'publicado')
                    ->orderBy('noticias_comunicados.fecha_publicacion', 'DESC')
                    ->findAll();