app/Models/UsuarioModel.php

    public function buscarPorCorreo(string $correo): ?array
    {
        return $this->where('correo', $correo)->first();
---
SELECT *
FROM `usuarios`
WHERE `correo` = 'alberto@gmail.com'
 LIMIT 1